blog/2016/12/24/monadas/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>Mónadas - Mario Román</title>
    <meta charset="utf-8" />
    <meta name="author" content="Mario Román" />
    <meta name="description" content="¡Otra! introducción a las mónadas." />
    <meta name="keywords" content="monadas" />
    <link rel="stylesheet" href="/media/css/main.css" type="text/css">
    <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
  </head>
  <body class="container">
    <div>
      <header class="masthead">
        <h1 class="masthead-title"><a href="/">Mario Román</a></h1>
        <p>M42 - mromang08@gmail.com</p>
        <ul>
          <li><a href="/blog/">Blog</a></li>
          <li><a href="/tags/">Tags</a></li>
          <li><a href="/about/">About</a></li>
          <li><a href="https://github.com/m42">GitHub</a></li>
          <li><a href="/rss.xml">RSS</a></li>
        </ul>
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="m42.github.io">
        </form>
      </header>
    </div>

<div>
<div class="post">
<h1>Mónadas</h1>
<blockquote>
<p>
A monad is just a monoid in the category of endofunctors, what's the
problem?
</p>

<p>
-- <b>Philip Walder</b> (apócrifa) en <i><a href="http://james-iry.blogspot.com.es/2009/05/brief-incomplete-and-mostly-wrong.html">A Brief, Incomplete, and Mostly Wrong History of programming languages</a></i>
</p>
</blockquote>

<div id="outline-container-org88e8e13" class="outline-2">
<h2 id="org88e8e13">Prerrequisitos</h2>
<div class="outline-text-2" id="text-org88e8e13">
<p>
Este artículo requiere un conocimiento previo de Haskell, o al menos, de
otro lenguaje de programación funcional. Puedes consultar nuestra
<a href="http://tux.ugr.es/dgiim/blog/2014/10/01/intro-haskell/">introducción a Haskell</a> con recursos para iniciarte en el lenguaje.
</p>

<p>
Por otro lado, para la segunda parte del artículo es recomendable
conocimiento previo sobre teoría de categorías. Aun así, no es necesaria
para leer la primera parte del artículo, donde hablamos de mónadas sin
hacer ninguna referencia explícita a la teoría de categorías. Si quieres
leer sobre ese tema, puedes consultar nuestros apuntes de
<a href="http://tux.ugr.es/dgiim/blog/2014/10/04/intro-categorias/">introducción a teoría de categorías</a>.
</p>
</div>
</div>

<div id="outline-container-org604111d" class="outline-2">
<h2 id="org604111d">Motivación para las mónadas</h2>
<div class="outline-text-2" id="text-org604111d">
</div><div id="outline-container-org2096813" class="outline-3">
<h3 id="mónadas-en-haskell"><a id="org2096813"></a>Mónadas en Haskell</h3>
<div class="outline-text-3" id="text-mónadas-en-haskell">
<p>
Imaginemos que necesitamos controlar cuando una función interna devuelve
un error, o cuando usa un estado que debe ser pasado al resto de
funciones. Cuando trabajamos con programación funcional pura, debemos
devolver explícitamente el error (señalar cómo va a tratarlo cada
función) o pasar el estado como argumento a cada una de las funciones;
así que una solución sería modificar cada una de las funciones que
usamos para que tenga en cuenta ese estado o ese caso de error, pero
esto añadiría mucha complejidad innecesaria a nuestro código. La
estructura de mónada simplifica esta escritura.
</p>

<p>
El siguiente ejemplo, en el que tratamos el manejo de errores
encapsulado en una mónada, está inspirado en los ejemplos de:
</p>

<ul class="org-ul">
<li><a href="http://homepages.inf.ed.ac.uk/wadler/papers/marktoberdorf/baastad.pdf">Monads for functional programming</a> - <i>Philip Wadler</i></li>
</ul>

<p>
Que es una muy buena introducción al uso de las mónadas en programación
funcional.
</p>
</div>
</div>

<div id="outline-container-org59c1210" class="outline-3">
<h3 id="org59c1210">Calculando raíces cuadradas</h3>
<div class="outline-text-3" id="text-org59c1210">
<p>
Por ejemplo, supongamos que intentamos sacar raíces cuadradas en los
reales usando el <a href="https://en.wikipedia.org/wiki/Integer_square_root#Algorithm">método de Newton</a>. Si intentamos calcular \(\sqrt{n}\), 
podemos tomar a cada paso la aproximación:
</p>

<p>
\[ x_{k+1} = \frac{1}{2}\left( x_k+\frac{n}{x_k} \right) \]
</p>

<p>
Y parar cuando estemos suficientemente cerca (más cerca que un ε dado):
</p>

<p>
\[ |x_{k+1} - x_k| < \varepsilon \]
</p>

<p>
Escribimos una implementación de ese concepto de convergencia para
listas infinitas en Haskell y del método de Newton, basado en la función
<a href="http://hackage.haskell.org/package/base-4.9.0.0/docs/Prelude.html#v:iterate"><code>iterate</code></a>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">limit :: Float -&gt; [Float] -&gt; Float
limit epsilon (x:y:xs)
  | abs (x-y) &lt; epsilon = y
  | otherwise           = limit epsilon (y:xs)

newtonaprox :: Float -&gt; Float -&gt; Float
newtonaprox n x = (x + n/x)/2

sqroot :: Float -&gt; Float
sqroot 0 = 0
sqroot x = limit 0.03 (iterate (newtonaprox x) x)
</pre>
</div>

<p>
Ahora imaginemos que usamos esta raíz cuadrada recién definida para
solucionar una ecuación de segundo grado \(x^2 + bx + c = 0\):
</p>

<p>
\[ x = \frac{-b \pm \sqrt{b^2 - 4c}}{2} \]
</p>

<p>
Podemos definir una estructura de datos <code>QPol</code> para el polinomio y una
función que lo resuelva obteniendo sus dos raíces:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data QPol = QPol Float Float Float

instance Show QPol where
    show (Qpol a b c) = show a ++ "x² + " ++ show b ++ "x + " show c

solve :: QPol -&gt; (Float,Float)
solve (QPol a b c) = (sol1 sol2)
    where sol1 = ((-b) + sqroot(b*b-4*c*a))/(2*a)
          sol2 = ((-b) - sqroot(b*b-4*c*a))/(2*a)
</pre>
</div>

<p>
Y podemos comprobar que funciona:
</p>

<pre class="example">
λ&gt; pol = QPol 1 (-5) 6
λ&gt; putStrLn $ "Las soluciones de " ++ show pol ++ " son " ++ solve pol
Las soluciones de 1.0x² + -5.0x + 6.0 son (3.0,2.0)
</pre>
</div>
</div>

<div id="outline-container-org053fc45" class="outline-3">
<h3 id="org053fc45">Controlando los errores</h3>
<div class="outline-text-3" id="text-org053fc45">
<p>
Pero ¿qué ocurre cuando intentamos calcular la raíz cuadrada de un
número no positivo? Este método no la encuentra, por lo que debería
devolver un error antes de intentar empezar a calcularla. La solución
obvia es reflejar este error con un <code>Maybe</code> en el cálculo de la raíz
cuadrada.
</p>

<div class="org-src-container">
<pre class="src src-haskell">sqroot' :: Float -&gt; Maybe Float
sqroot' x
  | x &lt; 0     = Nothing
  | x == 0    = Just 0.0
  | otherwise = Just ( limit 0.03 (iterate (newtonsqrt x) x) )
</pre>
</div>

<p>
Esto lo soluciona, pero nos crea un problema mayor. La función <code>solve</code>
está usando la raíz cuadrada y se espera de ella que devuelva un número,
no un posible error. Si queremos conseguir que funcione con la nueva
<code>sqroot'</code>, necesitaríamos implementar todas sus componentes internas
teniendo en cuenta ese error. Por ejemplo, deberíamos reescribir el
<code>(+)</code>, para tener en cuenta errores y propagarlos por todos los cálculos
involucrando a <code>sqroot'</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">(+.) :: Maybe Float -&gt; Maybe Float -&gt; Maybe Float
(+.) Nothing _ = Nothing
(+.) _ Nothing = Nothing
(+.) (Just a) (Just b) = Just (a + b)
</pre>
</div>

<p>
Pero esto es muy pesado de implementar; deberíamos implementarlo ¡para
cada una de las operaciones que usen la raíz cuadrada en algún punto!
Esto obliga a cada una de nuestras operaciones intermedias a ser
conscientes de la posibilidad de error, dándonos código mucho menos
modular y reusable.
</p>

<p>
Una solución ligeramente mejor es la de abstraer este proceso de hacer a
una función consciente de la posibilidad de error en una función aparte
y definir las demás en función suya:
</p>

<div class="org-src-container">
<pre class="src src-haskell">errorAware :: (a -&gt; b -&gt; c) -&gt; Maybe a -&gt; Maybe b -&gt; Maybe c
errorAware op Nothing _ = Nothing
errorAware op _ Nothing = Nothing
errorAware op (Just a) (Just b) = Just (op a b)

(+.), (*.) :: Maybe Float -&gt; Maybe Float -&gt; Maybe Float
(+.) = errorAware (+)
(*.) = errorAware (*)
</pre>
</div>

<p>
Esto nos permite hacer cálculos con ellas:
</p>

<pre class="example">
λ&gt; sqroot' (-3) +. Just 4
Nothing
λ&gt; sqroot' 3 +. Just 4
Just 5.732143
</pre>
</div>
</div>
