blog/2016/12/24/monadas/index.html

<div id="outline-container-org2cf5c54" class="outline-3">
<h3 id="org2cf5c54">La mónada Maybe</h3>
<div class="outline-text-3" id="text-org2cf5c54">
<p>
Esta idea para simplificar el tratamiento de errores, realizada
correctamente, es lo que nos va a proporcionar la estructura de mónada.
En Haskell, podemos definir una mónada como:
</p>

<div class="org-src-container">
<pre class="src src-haskell">class Monad m where
  (&gt;&gt;=)  :: m a -&gt; (a -&gt; m b) -&gt; m b
  return :: a -&gt; m a
</pre>
</div>

<p>
La idea intuitiva es que <code>(&gt;&gt;</code>)= nos permite tomar una función que puede
devolver errores pero que no comprueba a la entrada si ha recibido un
error, es decir, de tipo <code>(a -&gt; Maybe b)</code> ; y aplicarla sobre una
función que puede contener un error. La podríamos usar por ejemplo para
componer varias <code>sqroot'</code>, que era algo que hasta ahora no podíamos
hacer sin tratar cada posible caso de error. Y la función <code>return</code>, que
en este caso es simplemente <code>Just</code>, nos permite considerar una constante
como un posible error. Podemos calcular fácilmente así
\[\sqrt{\sqrt{3}}\] teniendo en cuenta los casos de error:
</p>

<div class="org-src-container">
<pre class="src src-haskell">sqroot' (sqroot' 3)              -- ¡Error de tipos!
sqroot' 3 &gt;&gt;= sqroot'            -- Usando mónadas
Just   3 &gt;&gt;= sqroot' &gt;&gt;= sqroot' -- Usando Just
return 3 &gt;&gt;= sqroot' &gt;&gt;= sqroot' -- Equivalente a lo anterior
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d8b3c1" class="outline-3">
<h3 id="org1d8b3c1">Notación do</h3>
<div class="outline-text-3" id="text-org1d8b3c1">
<p>
Las mónadas definen las funciones anteriores y muchas más que no vamos a
tratar ahora mismo, pero como resultado, nos acaban ofreciendo la
<b><a href="https://en.wikibooks.org/wiki/Haskell/do_notation">notación do</a></b>,
que es la que podemos usar para acabar escribiendo nuestra función
<code>solve</code> como:
</p>

<div class="org-src-container">
<pre class="src src-haskell">solve :: QPol -&gt; Maybe (Float,Float)
solve (QPol a b c) = do
  discriminant &lt;- sqroot' (b*b - 4*c*a)
  return (((-b) + discriminant)/(2*a), ((-b) - discriminant)/(2*a))
</pre>
</div>

<p>
En la primera línea tenemos en cuenta que la función <code>sqroot</code> puede
producir error, y en la segunda simplemente usamos el <i>posible</i>
resultado de ella sin tener que preocuparnos por el resto de funciones.
</p>

<p>
Nótese que la notación <b>do</b> es sólo una notación diseñada para aliviar
la escritura de operaciones con mónadas en algunos casos particulares;
es sólo <i>azúcar sintáctico</i> para operaciones que no dejan de ser
puramente funcionales. Existen críticas al uso de esta notación. [1]
</p>
</div>
</div>
</div>

<div id="outline-container-org2fbade1" class="outline-2">
<h2 id="org2fbade1">Mónadas en programación funcional</h2>
<div class="outline-text-2" id="text-org2fbade1">
</div><div id="outline-container-org00c7bbf" class="outline-3">
<h3 id="org00c7bbf">Mónadas como clase de tipos</h3>
<div class="outline-text-3" id="text-org00c7bbf">
<p>
Las mónadas en Haskell están definidas como una clase de tipos teniendo:
</p>

<ul class="org-ul">
<li>Un <b>constructor</b> de tipos <code>m ∷ * -&gt; *</code>, que para cada tipo <code>a</code>,
devuelve una mónada conteniéndolo, <code>m a</code>.</li>
<li>Una <b>función</b> <code>return ∷ a -&gt; m a</code>, que para todo elemento de tipo
<code>a</code>, devuelve una mónada que lo contiene.</li>
<li>Una <b>función</b> <code>(&gt;&gt;=) ∷ m a -&gt; (a -&gt; m b) -&gt; m b</code>, que dada una
mónada y una función que se aplique sobre su interior y devuelva otra
mónada, devuelve la mónada resultante. Sirve como composición de
funciones monádicas.</li>
</ul>

<p>
La existencia de la última función equivale a la existencia de otras dos
funciones <code>fmap ∷ (a -&gt; b) -&gt; m a -&gt; m b</code> y <code>join ∷ m (m a) -&gt; m a</code>.
</p>

<p>
Nótese entonces que para ser mónada, una clase de tipos debe ser primero
un funtor. Dentro de los funtores que conocemos, podemos reconocer
algunas mónadas, incluyendo la mónada <code>Maybe</code> que hemos usado hasta
ahora:
</p>

<div class="org-src-container">
<pre class="src src-haskell">-- Return de la mónada Maybe
return x = Just x

-- Bind de la mónada Maybe
(Just x) &gt;&gt;= k = k x
Nothing  &gt;&gt;= _ = Nothing

-- Return de la mónada List
return x = [x]

-- Bind de la mónada List
xs &gt;&gt;= f = [y | x &lt;- xs, y &lt;- f x]
</pre>
</div>

<p>
Puedes empezar a leer tutoriales sobre el uso de las mónadas en Haskell
en:
</p>

<ul class="org-ul">
<li><a href="http://learnyouahaskell.com/a-fistful-of-monads">A fistful of monads - Learn you a Haskell</a></li>
<li><a href="https://en.wikibooks.org/wiki/Haskell/Understanding_monads">Understanding monads - Wikibooks</a></li>
</ul>
</div>
</div>

<div id="outline-container-org648bcc9" class="outline-3">
<h3 id="org648bcc9">Mónada lista</h3>
<div class="outline-text-3" id="text-org648bcc9">
<p>
En las listas, por ejemplo, tenemos como candidato para
<code>join :: [[a]] -&gt; [a]</code> la concatenación de listas, <code>concat</code>. Nuestro
<code>return :: a -&gt; [a]</code> será simplemente incluir un elemento en una lista
que sólo lo contenga a él.
</p>

<p>
En esta mónada, <code>(&gt;&gt;</code>)= mapea una función <code>a -&gt; [a]</code> sobre cada elemento
de la lista y concatena todos los resultados:
</p>

<pre class="example">
λ&gt; [1,2,3] &gt;&gt;= (replicate 3)
[1,1,1,2,2,2,3,3,3]
</pre>

<p>
Nótese que, de la misma manera en la que podemos usar <code>(&gt;&gt;</code>)=, podemos
usar una versión con sus parámetros cambiados de orden, <code>(=&lt;&lt;)</code>. Aquí
usamos la mónada lista para enumerar los racionales repitiendo
elementos:[2]
</p>

<div class="org-src-container">
<pre class="src src-haskell">import Data.List
import Data.Ratio

-- Crea los racionales con denominador n
withDenom :: Integral -&gt; [Rational]
withDenom n = map (%n) [1..]

-- Para cada entero, crea los racionales que lo
-- tienen como denominador
rationalsDup :: [Rational]
rationalsDup = withDenom =&lt;&lt; [1..]

-- Evita duplicados con 'nub'
rationals :: [Rational]
rationals = nub rationalsDup
</pre>
</div>
</div>
</div>

<div id="outline-container-orge04885a" class="outline-3">
<h3 id="orge04885a">Mónada IO</h3>
<div class="outline-text-3" id="text-orge04885a">
<p>
La mónada IO surge como una solución al problema de implementar efectos
secundarios (como la lectura o escritura) en un lenguaje puro y de forma
extensible, sin tener que alterar el sistema de tipos y respetando el
orden en el que queremos que se ejecuten.
</p>

<div class="org-src-container">
<pre class="src src-haskell">greeting :: IO ()
greeting = fmap ("Hola, "++) getLine &gt;&gt;= print
</pre>
</div>

<p>
Pueden leerse más detalles sobre mónada IO y su implementación en:
</p>

<ul class="org-ul">
<li><a href="http://chris-taylor.github.io/blog/2013/02/09/io-is-not-a-side-effect/">IO is pure</a> - Chris Taylor</li>
<li><a href="https://www.microsoft.com/en-us/research/wp-content/uploads/1993/01/imperative.pdf">Imperative functional programming</a> - Simon L. Peyton Jones, Philip Wadler</li>
<li><a href="https://blog.jle.im/entry/first-class-statements">First-Class “Statements”</a> - Justin Le</li>
</ul>
</div>
</div>
