blog/2016/12/24/monadas/index.html

<div id="outline-container-org3cccd20" class="outline-3">
<h3 id="org3cccd20">Una categoría para la programación funcional</h3>
<div class="outline-text-3" id="text-org3cccd20">
<p>
Algunos sistemas de tipos, con las funciones entre ellos <code>A -&gt; B</code> como
morfismos, forman una categoría[3]. No es el caso de Haskell, en el que,
por varios motivos, sus tipos no forman una categoría[4]; pero las
construcciones con inspiración en la teoría de categorías toman el
nombre de sus homólogas.[5]
</p>

<p>
El primer ejemplo de esto son los <b>funtores</b>. En Haskell, un funtor se
define como:
</p>

<div class="org-src-container">
<pre class="src src-haskell">class Functor f where 
  fmap :: (a -&gt; b) -&gt; f a -&gt; f b
</pre>
</div>

<p>
Es decir un funtor toma un tipo <code>a</code> (un objeto de la categoría), y nos
devuelve otro tipo <code>f a</code> (otro objeto de la <i>misma</i> categoría). Por otro
lado, el funtor toma un morfismo <code>a -&gt; b</code> y nos devuelve otro morfismo
<code>f a -&gt; f b</code>. Es decir, los funtores de la programación funcional son
<b>endofuntores en la categoría de los tipos</b>, siempre que conserven
ciertas reglas que tienen su reflejo en las reglas de funtores en
Haskell.
</p>
</div>
</div>

<div id="outline-container-orga858725" class="outline-3">
<h3 id="orga858725">Monoides en la categoría de los endofuntores</h3>
<div class="outline-text-3" id="text-orga858725">
<p>
Entonces, si los funtores <code>f :: * -&gt; *</code> son endofuntores en alguna
categoría, tiene sentido cuestionarse cuáles de ellos son monoides.
Esto, junto con ciertas restricciones que se le imponen como leyes a las
mónadas, equivale a decir que existen los morfismos dados por las
transformaciones naturales que pedíamos antes, es decir, deben existir
morfismos de tipos <code>a -&gt; m a</code> y <code>m (m a) -&gt; m a</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">return :: a -&gt; m a
join :: m (m a) -&gt; m a
</pre>
</div>

<p>
Así, a cualquier funtor que tiene estos dos morfismos, además del <code>fmap</code>
que tenía por ser funtor, lo llamamos <b>mónada</b>. Nótese que <code>&gt;&gt;=</code> puede
implementarse desde <code>join</code> y viceversa, como:
</p>

<div class="org-src-container">
<pre class="src src-haskell">(&gt;&gt;=) :: m a -&gt; (a -&gt; m b) -&gt; m b
(&gt;&gt;=) x f = join (fmap f a)

join :: m (m a) -&gt; m a
join x = x &gt;&gt;= id
</pre>
</div>

<p>
Tenemos entonces dos definiciones equivalentes de lo que es una mónada.
Una desde la teoría de categorías y otra desde la teoría de tipos y los
lenguajes de programación funcional. Una visión desde las mónadas como
monoides en la categoría de los endofuntores desde dentro de Haskell
puede verse <a href="http://blog.sigfpe.com/2008/11/from-monoids-to-monads.html">aquí</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org18a49b7" class="outline-2">
<h2 id="org18a49b7">Y más</h2>
<div class="outline-text-2" id="text-org18a49b7">
<p>
Además de las enunciadas en este post, existen más otros temas
relevantes en relación a las mónadas, tanto en programación funcional
como en teoría de categorías:
</p>

<ul class="org-ul">
<li><a href="http://book.realworldhaskell.org/read/monad-transformers.html">Transformadores de mónadas</a>, usadas para componer mónadas.</li>
<li><a href="http://stackoverflow.com/questions/8428554/what-is-the-comonad-typeclass-in-haskell">Comónadas</a>, la noción dual de una mónada.</li>
<li><a href="https://en.wikipedia.org/wiki/Kleisli_category">Categorías de Kleisli</a>, cada mónada da lugar a una categoría de Kleisli.</li>
<li><a href="https://en.wikipedia.org/wiki/Adjoint_functors">Funtores adjuntos</a>, cada par de funtores adjuntos da lugar a una mónada.</li>
<li><a href="http://www.cs.tufts.edu/comp/150FP/archive/brent-yorgey/tc.pdf">Typeclassopedia</a>, una revisión de otras clases de tipos relevantes en Haskell y
relacionadas con la teoría de categorías.</li>
</ul>
</div>
</div>

<div id="outline-container-org9e07155" class="outline-2">
<h2 id="org9e07155">Referencias</h2>
<div class="outline-text-2" id="text-org9e07155">
<p>
[1] Peligros de la notación do.
    <a href="https://wiki.haskell.org/Do_notation_considered_harmful">Do notation considered harmful</a>
</p>

<p>
[2] Enumerando los racionales.
    <a href="http://www.cs.ox.ac.uk/people/jeremy.gibbons/publications/rationals.pdf">Enumerating the rationals - J. Gibbons, D. Lester, R. Bird</a>
</p>

<p>
[3] La correspondencia entre tipos, lógica y categorías.
    <a href="https://ncatlab.org/nlab/show/computational+trinitarianism">Computational Trinitarianism - NLab</a>
</p>

<p>
[4] Por qué los tipos de Haskell no son una categoría.
    <a href="http://math.andrej.com/2016/08/06/hask-is-not-a-category/">Hask is not a category - Andrej Bauer</a>
</p>

<p>
[5] Por qué en ocasiones puede ser útil pensar en ellos como una
    categoría.
    <a href="https://ro-che.info/articles/2016-08-07-hask-category">Does it matter if Hask is (not) a category?</a>
</p>
</div>
</div>

</div>
</div>
    <div>
      <div class="post-meta">
        <span title="post date" class="post-info">2016-12-24</span>
        <span title="last modification date" class="post-info">2016-12-26</span>
        <span title="tags" class="post-info"><a href="/tags/haskell/">haskell</a></span>
        <span title="author" class="post-info">Mario Román</span>
      </div>
      <script src="//code.jquery.com/jquery-latest.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
      <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
      <script src="/media/js/main.js"></script>
      <div class="footer">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:mromang08 &lt;at&gt; gmail &lt;dot&gt; com">Mario Román</a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

  </body>
</html>
